In [2]:
import pandas as pd 
import numpy as np

In [3]:
df=pd.read_csv("G:\My Drive\Titanic.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 1.how many rows and columns are in it ?

In [5]:
rows, columns = df.shape

In [8]:
print(f"Number of rows: {rows}")
print(f"Number of columns: {columns}")

Number of rows: 891
Number of columns: 12

# 2.in which class category more numbers of women died percentage from that class ?

In [9]:
women = df[df['Sex'] == 'female']

In [10]:
women

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [11]:
class_death_percentage = women.groupby('Pclass')['Survived'].apply(lambda x: (x == 0).mean() * 100)

In [12]:
class_death_percentage

Pclass
1     3.191489
2     7.894737
3    50.000000
Name: Survived, dtype: float64

In [13]:
class_death_percentage.idxmax()

3

In [14]:
class_death_percentage.max()

50.0

# 3.the oldest passenger was a male or a female ?

In [15]:
oldest_passenger = df.loc[df['Age'].idxmax()]

In [16]:
oldest_passenger

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

In [17]:
oldest_gender = oldest_passenger['Sex']
oldest_age = oldest_passenger['Age']

In [19]:
oldest_gender

'male'

In [20]:
oldest_age

80.0

In [18]:
print(f"The oldest passenger was a {oldest_gender} aged {oldest_age} years.")

The oldest passenger was a male aged 80.0 years.

# 4. find the name of the oldest survived female ?

In [21]:
survived_females = df[(df['Sex'] == 'female') & (df['Survived'] == 1)]

In [22]:
survived_females

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [23]:
oldest_survived_female = survived_females.loc[survived_females['Age'].idxmax()]

In [24]:
oldest_survived_female

PassengerId                                  276
Survived                                       1
Pclass                                         1
Name           Andrews, Miss. Kornelia Theodosia
Sex                                       female
Age                                         63.0
SibSp                                          1
Parch                                          0
Ticket                                     13502
Fare                                     77.9583
Cabin                                         D7
Embarked                                       S
Name: 275, dtype: object

In [25]:
oldest_female_name = oldest_survived_female['Name']
oldest_female_age = oldest_survived_female['Age']

In [26]:
oldest_female_name

'Andrews, Miss. Kornelia Theodosia'

In [27]:
oldest_female_age

63.0

In [28]:
print(f"The oldest surviving female passenger was {oldest_female_name}, aged {oldest_female_age} years.")

The oldest surviving female passenger was Andrews, Miss. Kornelia Theodosia, aged 63.0 years.

# 5. find the deatails of the youngest passenger who could not survived ?

In [30]:
non_survivors = df[df['Survived'] == 0]

In [31]:
non_survivors

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [32]:
youngest_non_survivor = non_survivors.loc[non_survivors['Age'].idxmin()]

In [33]:
youngest_non_survivor

PassengerId                             165
Survived                                  0
Pclass                                    3
Name           Panula, Master. Eino Viljami
Sex                                    male
Age                                     1.0
SibSp                                     4
Parch                                     1
Ticket                              3101295
Fare                                39.6875
Cabin                                   NaN
Embarked                                  S
Name: 164, dtype: object

In [35]:
youngest_passenger_details = youngest_non_survivor

In [36]:
youngest_passenger_details

PassengerId                             165
Survived                                  0
Pclass                                    3
Name           Panula, Master. Eino Viljami
Sex                                    male
Age                                     1.0
SibSp                                     4
Parch                                     1
Ticket                              3101295
Fare                                39.6875
Cabin                                   NaN
Embarked                                  S
Name: 164, dtype: object

# 6. overall, what percentage of passengers survived the disaster ?

In [38]:
number_of_survivors = df['Survived'].sum()

In [39]:
number_of_survivors

342

In [40]:
total_passengers = df.shape[0]

In [41]:
total_passengers

891

In [42]:
survival_percentage = (number_of_survivors / total_passengers) * 100

In [43]:
survival_percentage

38.38383838383838

In [44]:
print(f"Overall, {survival_percentage:.2f}% of passengers survived the disaster.")

Overall, 38.38% of passengers survived the disaster.

# 7.which sex of passengers were more on the board ?

In [45]:
passenger_counts_by_sex = df['Sex'].value_counts()

In [46]:
passenger_counts_by_sex

Sex
male      577
female    314
Name: count, dtype: int64

In [50]:
number_of_males = passenger_counts_by_sex['male']
number_of_females = passenger_counts_by_sex['female']

In [51]:
number_of_males

577

In [52]:
number_of_females

314

In [55]:
print(f"There were more male passengers on board the Titanic.")
print(f"Number of male passengers: {number_of_males}")

There were more male passengers on board the Titanic.
Number of male passengers: 577

# 8.which passenger has less average age ticket class wise ?

In [56]:
average_age_by_class = df.groupby('Pclass')['Age'].mean()

In [57]:
average_age_by_class

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [58]:
lowest_average_age_class = average_age_by_class.idxmin()
lowest_average_age = average_age_by_class.min()

In [59]:
lowest_average_age_class

3

In [60]:
lowest_average_age

25.14061971830986

In [61]:
print(f"The ticket class with the lowest average age is Class {lowest_average_age_class}.")
print(f"The average age in this class is {lowest_average_age:.2f} years.")

The ticket class with the lowest average age is Class 3.
The average age in this class is 25.14 years.

# 9.the highest fare belonged to which class ?

In [62]:
highest_fare_row = df.loc[df['Fare'].idxmax()]

In [63]:
highest_fare_row

PassengerId                 259
Survived                      1
Pclass                        1
Name           Ward, Miss. Anna
Sex                      female
Age                        35.0
SibSp                         0
Parch                         0
Ticket                 PC 17755
Fare                   512.3292
Cabin                       NaN
Embarked                      C
Name: 258, dtype: object

In [64]:
highest_fare_class = highest_fare_row['Pclass']
highest_fare = highest_fare_row['Fare']

In [65]:
highest_fare_class

1

In [66]:
highest_fare

512.3292

In [67]:
print(f"The highest fare belonged to Class {highest_fare_class}.")
print(f"The fare was {highest_fare:.2f} currency units.")

The highest fare belonged to Class 1.
The fare was 512.33 currency units.

# 10. which class has more number of passengers ?

In [68]:
passenger_counts_by_class = df['Pclass'].value_counts()

In [69]:
passenger_counts_by_class

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [70]:
most_passengers_class = passenger_counts_by_class.idxmax()
most_passengers_count = passenger_counts_by_class.max()

In [71]:
most_passengers_class

3

In [72]:
most_passengers_count

491

In [73]:
print(f"Class {most_passengers_class} had the most passengers.")
print(f"Number of passengers in this class: {most_passengers_count}")

Class 3 had the most passengers.
Number of passengers in this class: 491